index.html
<!DOCTYPE html>
<html lang="cn">
<head>
<!-- 2018-06-28 Thu 07:29 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>博客目录</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Cauchy(蒲启元)">
<link rel="stylesheet" href="https://cs2.swfu.edu.cn/org-info-js/org-manual.css" type="text/css">
</head>
<body>
<div id="content">
<h1 class="title">博客目录</h1>
<p>
推荐你在电脑上查看此页面。这是一个还在更新中的页面。
</p>


<p>
我一直希望成为Linux内核开发人员，或者成为Linux系统程序员，这是一个系统而漫长的过程，需要长期的学习和坚持。但无论如何这是我的兴趣并且我将以此为职业。写博客是这样一个过程的总结和记录。
这主要分为以下几步来进行：
</p>

<ul class="org-ul">
<li>1，学习Linux基本命令和Shell编程。</li>
<li>2，Linux系统函数编程。</li>
<li>3，使用Linux系统调用开发系统应用。</li>
<li>4，研究Linux内核。</li>
</ul>

<p>
根据以上步骤计划，目前暂时将各步化为对以下各书籍的学习。要注意的是，尽管是根据书籍来学习的，
书籍里的实例代码都是由我运行过的，我推崇Learning by doing的学习方法（目前只关注2）。
</p>

<ul class="org-ul">
<li>1：
<ul class="org-ul">
<li>书籍：<a href="./linux/books/1/sys.pdf">UNIX and Linux System Administration Handbook</a>。博客：<a href="./linux/blogs/sys/admin.html">UNIX和Linux系统管理</a>。</li>
</ul></li>

<li>2:
<ul class="org-ul">
<li>书籍：<a href="./linux/books/2/apue.pdf">Advanced Programming in the UNIX Environment</a>。博客：<a href="./linux/blogs/2/apue.html">UNIX高级编程</a>。</li>
</ul></li>
</ul>
</div>
<div id="postamble" class="status">
<p class="author">Author: Cauchy(蒲启元)</p>
<p class="date">Created: 2018-06-28 Thu 07:29</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
